{
  "brandInfo": {
    "companyName": {
      "value": "Indie Campers"
    },
    "companyDomain": {
      "value": "https://indiecampers.com"
    },
    "otherProfiles": {
      "value": ["https://blog.indiecampers.com/", "https://help.indiecampers.com/"]
    },
    "brandDescription": {
      "value": "Indie Campers is a leading global provider of campervan and RV rentals, offering travelers the flexibility to explore North America, Europe, and Oceania on their own terms. With a fleet of over 7,000 vehicles and more than 70 pick-up and drop-off locations, the company makes road trips accessible and convenient for adventurers of all experience levels. Founded in 2013, its mission is to democratize road trips by enhancing travel experiences and lowering prices for millions of travelers worldwide. Operating across three continents, Indie Campers is currently undergoing a significant transformation to set new industry standards for safety, transparency, and customer service."
    },
    "brandPointOfView": {
      "value": "Indie Campers believes in providing the freedom of movement and instilling the pleasure of road travel, inspiring and connecting travelers worldwide. The company is anchored in accessibility, reliability, and innovation, with the promise that 'your journey is our priority.' They are committed to keeping road travel accessible and effortless for all, democratizing the road trip experience through flexible, tech-enabled travel solutions."
    },
    "companySubDomains": {
      "value": ["blog.indiecampers.com", "help.indiecampers.com", "indiecampers.co.uk"]
    }
  },
  "targetAudience": {
    "proofPoints": {
      "value": [
        "Over 7,000 vehicles in fleet",
        "70+ locations across three continents",
        "Over 500,000 nights rented",
        "100,000+ happy travelers from 130+ countries",
        "20,921+ customer reviews on Trustpilot",
        "€62.5 million in funding raised (€35M in July 2024 + €27.5M extension in May 2025)",
        "Unlimited mileage included in rentals",
        "24/7 roadside assistance and customer support",
        "Largest selection of RVs and campervans with broadest geographical coverage"
      ]
    },
    "targetMarkets": {
      "value": [
        "Europe (primary market - Portugal, Spain, France, Italy, Germany, UK, Nordic countries)",
        "North America (USA and Canada - expanding market)",
        "Oceania (Australia and New Zealand)"
      ]
    },
    "customerPersonas": {
      "value": [
        {
          "name": "Young Explorers",
          "age": "Under 35 years old",
          "groupSize": "Groups of 2",
          "tripDuration": "Short trips",
          "experience": "Low experience campervanning",
          "characteristics": "Trendy, looking for unique experiences",
          "valueProposition": "Price and freedom",
          "channels": "Google, Facebook, Youtube, Bing, Instagram, TikTok, Yescapa, Outdoorsy"
        },
        {
          "name": "Family Adventurers",
          "age": "36-59 years old",
          "groupSize": "Groups of 3-4",
          "tripDuration": "1-2 weeks trips",
          "experience": "Mid-high experience campervanning",
          "characteristics": "Value family time, wellness and nature connection",
          "valueProposition": "Category awareness via benefits for families, reliability and safety",
          "channels": "Google, Facebook, Youtube, Bing, Instagram, TikTok, Yescapa, Outdoorsy"
        },
        {
          "name": "Seasoned Travelers",
          "age": "Over 60 years old",
          "groupSize": "Groups of 2",
          "tripDuration": "Longer trips",
          "experience": "High experience campervanning",
          "characteristics": "Enjoying comfort and long relaxed trips",
          "valueProposition": "IC's RTBs and competitive superiorities",
          "channels": "Offline agencies: Tui, Dertour"
        }
      ]
    },
    "targetCustomerSegments": {
      "value": [
        "Adventure enthusiasts seeking unique travel experiences",
        "Families looking for flexible and personalized travel options",
        "Digital nomads and remote workers combining work and travel",
        "First-time campervan renters seeking accessible entry into vanlife",
        "Experienced RV travelers looking for global coverage and flexibility",
        "Budget-conscious travelers seeking affordable road trip options",
        "Groups and friends planning multi-day adventures",
        "Travelers from 130+ countries seeking authentic local experiences"
      ]
    },
    "targetAudienceDescription": {
      "value": "Indie Campers serves a diverse community of travelers from over 130 countries who value freedom, flexibility, and authentic travel experiences. The primary audience includes adventure enthusiasts, families, and groups ranging from first-time campervan renters to seasoned travelers. The sweet spot comprises three main personas: Young Explorers (under 35) seeking unique, budget-friendly experiences; Family Adventurers (36-59) prioritizing safety and reliability for quality family time; and Seasoned Travelers (60+) looking for comfort and extended journeys. The audience is tech-savvy, values convenience through digital booking, and seeks the freedom to explore at their own pace with start-anywhere, end-anywhere flexibility."
    }
  },
  "writingGuidelines": {
    "guidelines": {
      "value": [
        {
          "id": "1760347502056",
          "do": "Avoid difficult/uncommon vocabulary (e.g., nimble campervans). Use simpler, conversational expressions. Avoid overuse of adjectives: Too many 'adjectivized' phrases (e.g., 'Spring brings wildflowers and mild temperatures…'). Prefer shorter, clearer phrasing. Add more connectors to sound more natural (e.g., also, however, as a result, first/then/finally). English should be easy to read for someone at a high school level. Use human, natural sounding language.",
          "dont": "Don't use overly corporate buzzwords or superlatives like 'the best in the universe'. Avoid dashes (–). Use commas or full sentences. Don't use bullet points or lists unless absolutely necessary; use paragraphs for a natural flow."
        },
        {
          "id": "article-length",
          "do": "Articles must be between 3 and 6 minutes of reading time. Write with detail and depth (avoid thin content). Expand each paragraph (avoid being too tight). Use at least three or four fun entrances or hooks throughout the article to keep readers engaged.",
          "dont": "Don't write promotional language or sales pitches. Avoid being too brief or superficial."
        },
        {
          "id": "structure",
          "do": "Always structure the text with a main title and subheadings, dividing into several paragraphs for readability. Write like a journal or travel blog with stories, tips, or experiences.",
          "dont": "Don't write in a stiff, formal manner. Avoid lack of structure or poor organization."
        },
        {
          "id": "usps-integration",
          "do": "Mention Indie Campers' USPs and PoDs when relevant: Widest vehicle offer (from rugged 4x4s to Class A RVs), Global coverage with 80+ locations, Unlimited mileage included, Extras and add-ons to customize the trip (bed kit, surfboards, BBQ kits, chairs and table for outside, etc.). Phrase obligations, rules, or laws positively (e.g., instead of 'Don't forget to…', say 'It's a great idea to…').",
          "dont": "Don't mention hidden fees or extra charges unless explicitly clarifying them. Avoid using 'luxury' unless context supports it."
        },
        {
          "id": "tone-consistency",
          "do": "Keep it enthusiastic, especially at the beginning of the article and whenever mentioning obligations, rules, or laws. Write in a cool, engaging blog style that feels authentic and inspiring. Aim for a persuasive travel guide style so it feels like an inspiring blog post from a reputable publication.",
          "dont": "Don't use any negative sentences or negative sentiment. Avoid sounding like an advertisement."
        }
      ]
    },
    "toneOfVoice": {
      "value": [
        "Adventurous, inviting, and informative with an enthusiastic and engaging personality that inspires readers to explore and embrace new experiences",
        "Fun, witty, and positive - avoid any negative sentences or negative sentiment",
        "Communicates with vivid imagery, direct engagement, and clear explanations to guide and excite readers",
        "Approachable and trustworthy - like a well-traveled explorer who's also your helpful friend",
        "Inspirational and modern - someone who's curious, energetic, and spontaneous but grounded in responsibility",
        "Speaks with warmth and encouragement, always offering practical tips and insider knowledge",
        "Bold enough to go off the beaten path, but also dependable and organized behind the scenes",
        "Uses lively and descriptive language to paint vivid pictures",
        "Directly addresses the reader to create engagement",
        "Includes clear and concise explanations",
        "Encourages exploration and curiosity through enthusiastic language",
        "Uses short, punchy sentences to maintain energy and momentum",
        "Employs paragraphs for flow rather than lists and bullet points for easy digestibility"
      ]
    },
    "authorPersona": {
      "value": "Indie Campers as a person is like a well-traveled explorer who's also your helpful friend. They're someone who's curious, energetic, and spontaneous—but grounded in responsibility. They speak with warmth and encouragement, always offering practical tips and insider knowledge. They're bold enough to go off the beaten path, but also dependable and organized behind the scenes. This persona embodies values of enthusiasm, clarity, engagement, and inspiration."
    },
    "examplePhrases": {
      "value": [
        "Your 20s are all about freedom, adventure, and making memories. The best way to experience Australia? An unforgettable Australia campervan adventure!",
        "This is Australia's classic drive. The Great Ocean Road is famous worldwide, and for good reason. Start in Torquay, the home of Aussie surf culture, then chill in Lorne's cafés or swim in rock pools at Point Addis.",
        "Imagine starting your day with mountain views instead of office walls. More and more people are embracing the freedom of remote work on the road, mixing the adventure of an RV trip with the freedom of a flexible job.",
        "Australia was made for road trips. Every mile is a new story waiting to happen. Stop at local bakeries, jump in swimming holes, take random detours, and chat with locals, you will always find something unexpected.",
        "Red rocks glow, slot canyons twist, and clear desert air turns every sunset into a watercolor painting.",
        "Island roads were made for slow travel. They follow the water, slip through small towns and loop back to the place you began.",
        "Aim for three to four hours on the road each travel day.",
        "Sketch out your must see stops and reliable fuel points, but leave room to linger around."
      ]
    },
    "inspirationArticles": {
      "value": [
        "https://blog.indiecampers.com/",
        "https://indiecampers.com/blog/road-trip-tips",
        "https://blog.indiecampers.com/7-essential-campervan-tips-for-first-time/",
        "https://blog.indiecampers.com/category/destinations-en/",
        "https://indiecampers.com/blog/travelers/how-to-guides-2/"
      ]
    },
    "vocabularyPreferences": {
      "value": [
        "Preferred/encouraged terms: 'Road trip', 'adventure', 'journey', 'Flexible', 'seamless', 'freedom', 'discover', 'explore', 'Personalized', 'local', 'authentic', 'Start anywhere, end anywhere', 'Digital experience', 'mobile booking', 'easy pick-up/drop-off', 'campervan', 'RV', 'motorhome', 'vanlife'",
        "Terms/phrases to avoid (or use carefully): 'Luxury' (unless context supports it) — the brand leans more toward accessible exploration, 'Mission critical' or overly corporate buzzwords, 'Hidden fees', 'extra charges' (unless you're explicitly clarifying them), Overuse of superlatives ('the best in the universe'), Difficult or uncommon vocabulary, Negative phrasing or sentiment"
      ]
    }
  }
}
